cpp_inheritance.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-03-06 Tue 14:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>C++ Inheritance</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="c++ inheritance" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">C++ Inheritance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org430c9c8">1. Inheritance</a></li>
<li><a href="#orgb4b84bb">2. Protected</a></li>
<li><a href="#org2309fae">3. Access Control and Inheritance</a></li>
<li><a href="#org37e4f45">4. Type of Inheritance</a></li>
</ul>
</div>
</div>

<div id="outline-container-org430c9c8" class="outline-2">
<h2 id="org430c9c8"><span class="section-number-2">1</span> Inheritance</h2>
<div class="outline-text-2" id="text-1">
<p>
It is a mechanizme that allows to create a new classes which extend the existed one.
</p>
<div class="org-src-container">
<pre class="src src-cpp" id="org6229655"><span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Person</span> {
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">name_</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">age_</span>;

<span style="color: #00ff00; font-weight: bold;">public</span>:
    <span style="color: #00ffff; font-weight: bold;">Person</span> () : name_(<span style="color: #ffa500;">"John"</span>), age_(33) {}
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #00ffff; font-weight: bold;">name</span>() <span style="color: #00ff00; font-weight: bold;">const</span> { <span style="color: #00ff00; font-weight: bold;">return</span> name_; }
    <span style="color: #00ffff;">int</span>          <span style="color: #00ffff; font-weight: bold;">age</span>() <span style="color: #00ff00; font-weight: bold;">const</span> { <span style="color: #00ff00; font-weight: bold;">return</span> age_;  }
};

<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">Student</span> : <span style="color: #00ffff;">Person</span> {
    <span style="color: #00ffff; font-weight: bold;">Student</span> () : uni_(<span style="color: #ffa500;">"USMA"</span>) {}
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #00ffff; font-weight: bold;">university</span>() <span style="color: #00ff00; font-weight: bold;">const</span> { <span style="color: #00ff00; font-weight: bold;">return</span> uni_; }

<span style="color: #00ff00; font-weight: bold;">private</span>:
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">uni_</span>;
};
</pre>
</div>
<p>
Objects of the derived class can call public methods of the base class
</p>
<div class="org-src-container">
<pre class="src src-cpp">


<span style="color: #00ffff;">Student</span> <span style="color: #ffffff;">s</span>;
<span style="color: #7fffd4;">std</span>::cout &lt;&lt; s.name() &lt;&lt; <span style="color: #7fffd4;">std</span>::endl
          &lt;&lt; s.age() &lt;&lt; <span style="color: #7fffd4;">std</span>::endl
          &lt;&lt; s.university() &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

</pre>
</div>

<pre class="example">
John
33
USMA

</pre>
<p>
There is an object of the base class inside a derived class.
When you create an object of a derived class, compiler call the constructor of the base class and then the constructor of a derived class.
</p>
<div class="org-src-container">
<pre class="src src-cpp" id="orgef8c881"><span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Person</span> {
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">name_</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">age_</span>;

<span style="color: #00ff00; font-weight: bold;">public</span>:
    <span style="color: #00ffff; font-weight: bold;">Person</span> () : name_(<span style="color: #ffa500;">"John"</span>), age_(33) {}
    <span style="color: #00ffff; font-weight: bold;">Person</span> (<span style="color: #00ff00; font-weight: bold;">const</span> <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span>&amp; <span style="color: #ffffff;">name</span>, <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">age</span>) :
        name_(name), <span style="color: #00ffff;">age_</span>(<span style="color: #ffffff;">age</span>) {}
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #00ffff; font-weight: bold;">name</span>() <span style="color: #00ff00; font-weight: bold;">const</span> { <span style="color: #00ff00; font-weight: bold;">return</span> name_; }
    <span style="color: #00ffff;">int</span>          <span style="color: #00ffff; font-weight: bold;">age</span>() <span style="color: #00ff00; font-weight: bold;">const</span> { <span style="color: #00ff00; font-weight: bold;">return</span> age_;  }
};

<span style="color: #00ff00; font-weight: bold;">class</span> <span style="color: #00ffff;">Student</span> : <span style="color: #00ff00; font-weight: bold;">public</span> <span style="color: #00ffff;">Person</span> {
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">uni_</span>;

<span style="color: #00ff00; font-weight: bold;">public</span>:
    <span style="color: #00ffff; font-weight: bold;">Student</span> () : uni_(<span style="color: #ffa500;">"USMA"</span>) {}
    <span style="color: #00ffff; font-weight: bold;">Student</span> (<span style="color: #00ff00; font-weight: bold;">const</span> <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">name</span>, <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">age</span>, <span style="color: #00ff00; font-weight: bold;">const</span> <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">uni</span>) :
        Person(name, age), uni_(uni) {}
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #00ffff; font-weight: bold;">university</span>() <span style="color: #00ff00; font-weight: bold;">const</span> { <span style="color: #00ff00; font-weight: bold;">return</span> uni_; }
};
</pre>
</div>

<div class="org-src-container">
<pre class="src src-cpp">


<span style="color: #00ffff;">Student</span> <span style="color: #ffffff;">s</span>(<span style="color: #ffa500;">"Pavel"</span>, 29, <span style="color: #ffa500;">"None"</span>);
<span style="color: #7fffd4;">std</span>::cout &lt;&lt; s.name() &lt;&lt; <span style="color: #7fffd4;">std</span>::endl
          &lt;&lt; s.age() &lt;&lt; <span style="color: #7fffd4;">std</span>::endl
          &lt;&lt; s.university() &lt;&lt; <span style="color: #7fffd4;">std</span>::endl;

</pre>
</div>

<pre class="example">
Pavel
29
None

</pre>
<p>
Now we can use Person object as Student object:
</p>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ffff;">Student</span> <span style="color: #ffffff;">s</span>(<span style="color: #ffa500;">"Pavel"</span>, 29, <span style="color: #ffa500;">"None"</span>);
<span style="color: #00ffff;">Person</span> &amp; <span style="color: #ffffff;">l</span> = s;                 <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Student &amp; -&gt; Person &amp;</span>
<span style="color: #00ffff;">Person</span> * <span style="color: #ffffff;">r</span> = &amp;s;                <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Student * -&gt; Person *</span>
<span style="color: #00ffff;">Person</span> <span style="color: #ffffff;">p</span> = s;                   <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Person("Pavel", 29);</span>
</pre>
</div>

<p>
When we assign an object of the derived class to an object of the base class we do copy only these fields that
were defined in the base class.
(We call construct Person(Person const&amp; p) which doesn't know anything about <b>uni_</b> field.)
</p>
</div>
</div>

<div id="outline-container-orgb4b84bb" class="outline-2">
<h2 id="orgb4b84bb"><span class="section-number-2">2</span> Protected</h2>
<div class="outline-text-2" id="text-2">
<p>
If a structure has access modificator <b>protected</b> it means that
</p>
<ol class="org-ol">
<li>Derived class has no access to <b>private</b> members of the base class.</li>
<li>Derived class has access to a <b>protected</b> members of the base class.</li>
</ol>
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">Person</span> {
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">&#8230;</span>
<span style="color: #00ff00; font-weight: bold;">protected</span>:
    <span style="color: #7fffd4;">std</span>::<span style="color: #00ffff;">string</span> <span style="color: #ffffff;">name_</span>;
    <span style="color: #00ffff;">int</span> <span style="color: #ffffff;">age_</span>;
};

<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">Can change fields name_ and age_ of the base class Person</span>
<span style="color: #00ff00; font-weight: bold;">struct</span> <span style="color: #00ffff;">Student</span> : <span style="color: #00ffff;">Person</span> {
    <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">&#8230;</span>
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org2309fae" class="outline-2">
<h2 id="org2309fae"><span class="section-number-2">3</span> Access Control and Inheritance</h2>
<div class="outline-text-2" id="text-3">
<p>
A derived class can access all the non-private members of its base class.
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-center" />
</colgroup>

<colgroup>
<col  class="org-center" />
</colgroup>

<colgroup>
<col  class="org-center" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Access</th>
<th scope="col" class="org-center">public</th>
<th scope="col" class="org-center">protected</th>
<th scope="col" class="org-center">private</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Same class</td>
<td class="org-center">yes</td>
<td class="org-center">yes</td>
<td class="org-center">yes</td>
</tr>

<tr>
<td class="org-left">Derived class</td>
<td class="org-center">yes</td>
<td class="org-center">yes</td>
<td class="org-center">no</td>
</tr>

<tr>
<td class="org-left">Outside class</td>
<td class="org-center">yes</td>
<td class="org-center">no</td>
<td class="org-center">no</td>
</tr>
</tbody>
</table>
<p>
A derived class inherits all base class methods with the following exceptions:
</p>
<ul class="org-ul">
<li>Constructors, desctructors and copy constructors of the base class.</li>
<li>Overloaded operators of the base class.</li>
<li>The friend functions of the base class.</li>
</ul>
</div>
</div>

<div id="outline-container-org37e4f45" class="outline-2">
<h2 id="org37e4f45"><span class="section-number-2">4</span> Type of Inheritance</h2>
<div class="outline-text-2" id="text-4">
<p>
When deriving a class from a base class, the base class may be inherited through <b>public</b>, <b>protected</b> or <b>private</b> inheritance.
<b>protected</b> or <b>private</b> inheritance are hardly used, but <b>public</b> inheritacne is commonly used.
</p>
<dl class="org-dl">
<dt>Public inheritance</dt><dd>When deriving a class from a <b>public</b> base class, <b>public</b> members of the base class become <b>public</b> memebers
of the derived class and <b>protected</b> members of the base class become <b>protected</b> members of the derived class.
A base class <b>private</b> members are never accessible directly from a derived class, but can be accessed through calls to the <b>public</b>
and <b>protected</b> members of the base class.</dd>
<dt>Protected inheritance</dt><dd>When deriving from a <b>protected</b> base class, <b>public</b> and <b>protected</b> members of the base class become <b>protected</b>
members of the derived class.</dd>
<dt>Private inheritance</dt><dd>When deriving from a <b>private</b> base class, <b>public</b> and <b>protected</b> members of the base class become <b>private</b>
members of the derived class.</dd>
</dl>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2018-03-06 Tue 14:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
